_site/org/org/org/2016-6-1-LaTeX安装.org
#+BEGIN_HTML
---
layout: post
title: LaTex,Beamer和中文支持
excerpt: 主要介绍在Linux上安装LaTex。包括字体安装，Beamer介绍，以及orgmode生成的包含中文的tex编译，最终得到PDF。
---
#+END_HTML
#+OPTIONS: toc:nil
#+OPTIONS: ^:{} 

* LaTex和Beamer安装
Debian上直接安装texlive发行版，包括所有组件，命令是
#+BEGIN_SRC 
apt-get install texlive-all textlive-* 
apt-get install latex-beamer
#+END_SRC
这就装了xelatex，lualatex，这两个是后面应用中文字体的关键，主要是因为fontsenc要用xelatex或者lualatex.
原来中文支持比较麻烦，现在直接用ctex包非常方便，直接用
#+BEGIN_SRC
\usepackage{ctex}
#+END_SRC
就可以了。
* 字体安装
字体安装都是将字体下载下来，或者从Windows中拷贝出来，字体格式大部分是ttf，也有其他格式，在gnome下直接双击会显示是否安装。
字体在Windows中的位置是C://Windows/Fonts，然后将字体复制到Linux目录中，位置是/usr/share/fonts，注意只要在fonts目录
下，系统会自动遍历子目录中的字体。最后使用命令fc-cache来安装所有fonts目录下的所有字体。可以用fc-list来查看系统中有的字体。
命令fc-list :lang=zh可以查看所有的中文字体。除了Windows中的字体外，还要下周adobe的三个免费字体，因为在有中文时simkai字体
始终会报错，目前还没有解决，只好使用adobe字体。adobe字体可以在github上的adobe-fonts用户的仓库中下载。
* 中文支持
因为安装了texlive所有包，因此已经包含了ctex包，这样使用中文已经非常方便，由于上面提到的字体原因，因此在tex文件中使用以下语句：
#+BEGIN_SRC
\usepackage[adobefonts]{ctex}
#+END_SRC
这里表示使用的是adobe字体。同时用orgmode生成的含有中文的tex文件中可以直接加入这一行之后再用xelatex或lualatex编译，就可以得到
中文的pdf了。
* Beamer
为了使用中文，也要加入上面的语句。
* 注意
还有以下问题没有弄清楚或者没有解决：
+ 不使用adobefonts会报错，显示没有simkai的问题
+ xelatex、lualatex、pdflatex和latex之间关系，针对不同问题用哪一个
+ 目前安装的字体或者包都只有root用户可以使用，因此每次编译的时候需要是root用户
+ 如何在Beamer中使用外部的主题包
